openfoam/turek_fsi/0/cellDeterminant
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      cellDeterminant;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
112699
(
1.43007e-39
7.80329e-37
5.02194e-36
3.31519e-39
9.29057e-36
2.09869e-36
2.27636e-35
6.00361e-36
...
)
;

boundaryField
{
    Fluid
    {
        type            zeroGradient;
    }
    Solid
    {
        type            zeroGradient;
    }
    Back
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
