openfoam/turek_fsi/0/cellVolume
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      cellVolume;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
112699
(
1.22129e-07
1.13089e-07
1.36612e-07
4.93914e-08
1.22448e-07
8.54099e-08
1.24418e-07
1.10217e-07
...
)
;

boundaryField
{
    Fluid
    {
        type            calculated;
        value           uniform 0;
    }
    Solid
    {
        type            calculated;
        value           nonuniform List<scalar> 0();
    }
    Back
    {
        type            calculated;
        value           uniform 0;
    }
    defaultFaces
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
