openfoam/turek_fsi/0/cellVolumeRatio
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      cellVolumeRatio;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
112699
(
0.896675
0.728007
0.845428
0.892176
0.843596
0.934832
0.773277
0.709597
...
)
;

boundaryField
{
    Fluid
    {
        type            calculated;
        value           uniform 1;
    }
    Solid
    {
        type            calculated;
        value           nonuniform List<scalar> 0();
    }
    Back
    {
        type            calculated;
        value           uniform 1;
    }
    defaultFaces
    {
        type            calculated;
        value           uniform 1;
    }
}


// ************************************************************************* //
