openfoam/turek_fsi/0/faceWeight
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      faceWeight;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    Fluid
    {
        type            calculated;
        value           uniform 1;
    }
    Solid
    {
        type            calculated;
        value           nonuniform List<scalar> 0();
    }
    Back
    {
        type            calculated;
        value           uniform 1;
    }
    defaultFaces
    {
        type            calculated;
        value           uniform 1;
    }
}


// ************************************************************************* //
