openfoam/turek_fsi/0/minPyrVolume
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      minPyrVolume;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
112699
(
2.03549e-08
1.88482e-08
2.27687e-08
8.2319e-09
2.04081e-08
1.4235e-08
2.07363e-08
1.83695e-08
...
)
;

boundaryField
{
    Fluid
    {
        type            zeroGradient;
    }
    Solid
    {
        type            zeroGradient;
    }
    Back
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
