openfoam/turek_fsi/0/nonOrthoAngle
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      nonOrthoAngle;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
112699
(
6.81164
8.14902
6.44461
12.99
4.08378
5.73721
1.81131
3.1633
...
)
;

boundaryField
{
    Fluid
    {
        type            calculated;
        value           uniform 0;
    }
    Solid
    {
        type            calculated;
        value           nonuniform List<scalar> 0();
    }
    Back
    {
        type            calculated;
        value           uniform 0;
    }
    defaultFaces
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
