openfoam/turek_fsi/0/skewness
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      skewness;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
112699
(
0.037817
0.185174
0.0613768
0.0286625
0.041892
0.0083123
0.0896227
0.143157
...
)
;

boundaryField
{
    Fluid
    {
        type            calculated;
        value           nonuniform List<scalar> 
112699
(
5.58758e-15
0
8.17192e-14
5.63544e-14
0
2.19558e-14
4.38321e-14
6.0223e-15
...
)
;
    }
    Solid
    {
        type            calculated;
        value           nonuniform List<scalar> 0();
    }
    Back
    {
        type            calculated;
        value           nonuniform List<scalar> 
112699
(
5.58758e-15
0
8.17192e-14
5.55112e-14
0
2.19558e-14
4.05232e-14
9.85406e-15
...
)
;
    }
    defaultFaces
    {
        type            calculated;
        value           nonuniform List<scalar> 
1535
(
0.0990955
0.13137
0.0293668
0.00926208
0.0447078
0.00318067
0.0258045
0.0194993
...
)
;
    }
}


// ************************************************************************* //
