openfoam/turek_fsi/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          41;
        startFace       20209;
    }
    outlet
    {
        type            patch;
        nFaces          41;
        startFace       20250;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          250;
        startFace       20291;
    }
    topWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          250;
        startFace       20541;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          10250;
        startFace       20791;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          10250;
        startFace       31041;
    }
)

// ************************************************************************* //
