openfoam/turek_fsi/constant/transportProperties
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object transportProperties;
}

nu 1e-3;
