openfoam/turek_fsi/system/blockMeshDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object blockMeshDict;
}

convertToMeters 1.0;

vertices
(
    (0     0     0)
    (2.5   0     0)
    (2.5   0.41  0)
    (0     0.41  0)

    (0     0     0.01)
    (2.5   0     0.01)
    (2.5   0.41  0.01)
    (0     0.41  0.01)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (250 41 1)
    simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }

    bottomWall
    {
        type wall;
        faces
        (
            (0 4 5 1)
        );
    }

    topWall
    {
        type wall;
        faces
        (
            (3 2 6 7)
        );
    }

    front
    {
        type empty;
        faces
        (
            (0 1 2 3)
        );
    }

    back
    {
        type empty;
        faces
        (
            (4 7 6 5)
        );
    }
);

mergePatchPairs
(
);
