openfoam/turek_fsi/system/controlDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object controlDict;
}

application icoFoam;

startFrom startTime;

startTime 0;

stopAt endTime;

endTime 2;

deltaT 0.005;

writeControl timeStep;

writeInterval 100;

purgeWrite 0;

writeFormat ascii;

writePrecision 6;

runTimeModifiable true;
